tutorials/heatTransfer/directChillFoam/Subroto2021/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format          ascii;
    class           volScalarField;
    location        "0";
    object          p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -1 -2 0 0 0 0 ];

internalField   uniform 100000;

boundaryField
{
    "(hot-top|graphite|mould|air-gap|water-film)"
    {
        type            calculated;
        value           $internalField;
    }

    ram
    {
        type            calculated;
        value           $internalField;
    }

    free-surface
    {
        type            calculated;
        value           $internalField;
    }
    
    symmetry_planes
    {
        type            symmetry;
    }
}


// ************************************************************************* //
