tutorials/heatTransfer/directChillFoam/Subroto2021/constant/HTC_T
(
    (283.0000 1391.96481)
    (286.8693 1391.96481)
    (290.7387 1391.96481)
    (294.6080 1391.96481)
    (298.4774 1391.96481)
    (302.3467 1391.96481)
    (306.2161 1391.96481)
    (310.0854 1391.96481)
    (313.9548 1391.96481)
    (317.8241 1391.96481)
    (321.6935 1391.96481)
    (325.5628 1391.96481)
    (329.4322 1391.96481)
    (333.3015 1391.96481)
    (337.1709 1391.96481)
    (341.0402 1391.96481)
    (344.9095 1391.96481)
    (348.7789 1391.96481)
    (352.6482 1391.96481)
    (356.5176 1391.96481)
    (360.3869 1391.96481)
    (364.2563 1391.96481)
    (368.1256 1391.96481)
    (371.9950 1391.96481)
    (375.8643 1391.96481)
    (379.7337 2890.02563)
    (383.6030 6660.08032)
    (387.4724 13407.17325)
    (391.3417 14561.78472)
    (395.2111 16114.97168)
    (399.0804 18103.61605)
    (402.9497 20556.93235)
    (406.8191 23498.36173)
    (410.6884 26946.93101)
    (414.5578 30918.24506)
    (418.4271 35425.22299)
    (422.2965 40478.65212)
    (426.1658 46087.61028)
    (430.0352 52259.79152)
    (433.9045 59001.76013)
    (437.7739 66319.15062)
    (441.6432 74216.82674)
    (445.5126 82699.00892)
    (449.3819 91769.37720)
    (453.2513 101431.15506)
    (457.1206 111687.17807)
    (460.9899 122539.95059)
    (464.8593 133991.69268)
    (468.7286 146044.37939)
    (472.5980 158699.77363)
    (476.4673 171959.45390)
    (480.3367 185824.83782)
    (484.2060 200297.20206)
    (488.0754 215377.69950)
    (491.9447 231067.37383)
    (495.8141 247367.17220)
    (499.6834 264277.95611)
    (503.5528 281800.51091)
    (507.4221 299935.55400)
    (511.2915 318683.74205)
    (515.1608 338045.67726)
    (519.0302 358021.91293)
    (522.8995 378612.95830)
    (526.7688 399819.28286)
    (530.6382 421641.32016)
    (534.5075 444079.47115)
    (538.3769 467134.10725)
    (542.2462 490805.57295)
    (546.1156 515094.18826)
    (549.9849 540000.25082)
    (553.8543 565524.03784)
    (557.7236 591665.80779)
    (561.5930 618425.80200)
    (565.4623 645804.24603)
    (569.3317 673801.35093)
    (573.2010 702417.31442)
    (577.0704 731652.32190)
    (580.9397 761506.54741)
    (584.8090 791980.15447)
    (588.6784 823073.29688)
    (592.5477 854786.11942)
    (596.4171 887118.75850)
    (600.2864 920071.34279)
    (604.1558 953643.99371)
    (608.0251 987836.82596)
    (611.8945 1022649.94798)
    (615.7638 1058083.46236)
    (619.6332 1094137.46625)
    (623.5025 1130812.05169)
    (627.3719 1168107.30596)
    (631.2412 1206023.31189)
    (635.1106 1244560.14809)
    (638.9799 1283717.88930)
    (642.8492 1323496.60654)
    (646.7186 1363896.36741)
    (650.5879 1404917.23623)
    (654.4573 1446559.27429)
    (658.3266 1488822.53999)
    (662.1960 1531707.08902)
    (666.0653 1575212.97453)
    (669.9347 1619340.24725)
    (673.8040 1664088.95563)
    (677.6734 1709459.14600)
    (681.5427 1755450.86263)
    (685.4121 1802064.14788)
    (689.2814 1849299.04229)
    (693.1508 1897155.58469)
    (697.0201 1945633.81227)
    (700.8894 1994733.76067)
    (704.7588 2044455.46408)
    (708.6281 2094798.95528)
    (712.4975 2145764.26574)
    (716.3668 2197351.42567)
    (720.2362 2249560.46409)
    (724.1055 2302391.40887)
    (727.9749 2355844.28683)
    (731.8442 2409919.12373)
    (735.7136 2464615.94437)
    (739.5829 2519934.77261)
    (743.4523 2575875.63142)
    (747.3216 2632438.54292)
    (751.1910 2689623.52842)
    (755.0603 2747430.60846)
    (758.9296 2805859.80284)
    (762.7990 2864911.13065)
    (766.6683 2924584.61032)
    (770.5377 2984880.25961)
    (774.4070 3045798.09569)
    (778.2764 3107338.13512)
    (782.1457 3169500.39391)
    (786.0151 3232284.88751)
    (789.8844 3295691.63087)
    (793.7538 3359720.63843)
    (797.6231 3424371.92416)
    (801.4925 3489645.50157)
    (805.3618 3555541.38374)
    (809.2312 3622059.58332)
    (813.1005 3689200.11255)
    (816.9698 3756962.98329)
    (820.8392 3825348.20704)
    (824.7085 3894355.79492)
    (828.5779 3963985.75771)
    (832.4472 4034238.10586)
    (836.3166 4105112.84952)
    (840.1859 4176609.99851)
    (844.0553 4248729.56236)
    (847.9246 4321471.55032)
    (851.7940 4394835.97137)
    (855.6633 4468822.83421)
    (859.5327 4543432.14731)
    (863.4020 4618663.91888)
    (867.2714 4694518.15690)
    (871.1407 4770994.86911)
    (875.0101 4848094.06305)
    (878.8794 4925815.74603)
    (882.7487 5004159.92517)
    (886.6181 5083126.60738)
    (890.4874 5162715.79939)
    (894.3568 5242927.50775)
    (898.2261 5323761.73882)
    (902.0955 5405218.49878)
    (905.9648 5487297.79368)
    (909.8342 5569999.62936)
    (913.7035 5653324.01155)
    (917.5729 5737270.94581)
    (921.4422 5821840.43755)
    (925.3116 5907032.49205)
    (929.1809 5992847.11445)
    (933.0503 6079284.30975)
    (936.9196 6166344.08283)
    (940.7889 6254026.43846)
    (944.6583 6342331.38127)
    (948.5276 6431258.91578)
    (952.3970 6520809.04641)
    (956.2663 6610981.77745)
    (960.1357 6701777.11310)
    (964.0050 6793195.05745)
    (967.8744 6885235.61450)
    (971.7437 6977898.78814)
    (975.6131 7071184.58219)
    (979.4824 7165093.00035)
    (983.3518 7259624.04625)
    (987.2211 7354777.72344)
    (991.0905 7450554.03537)
    (994.9598 7546952.98542)
    (998.8291 7643974.57689)
    (1002.6985 7741618.81301)
    (1006.5678 7839885.69692)
    (1010.4372 7938775.23172)
    (1014.3065 8038287.42040)
    (1018.1759 8138422.26591)
    (1022.0452 8239179.77112)
    (1025.9146 8340559.93886)
    (1029.7839 8442562.77187)
    (1033.6533 8545188.27284)
    (1037.5226 8648436.44440)
    (1041.3920 8752307.28913)
    (1045.2613 8856800.80955)
    (1049.1307 8961917.00812)
    (1053.0000 9067655.88725)
)