tutorials/heatTransfer/directChillFoam/Subroto2021/constant/HTC_Tw
(
    (273.0000 218133.04924)
    (276.9196 202294.83389)
    (280.8392 187095.72970)
    (284.7588 172535.73669)
    (288.6784 158614.85484)
    (292.5980 145333.08418)
    (296.5176 132690.42471)
    (300.4372 120686.87643)
    (304.3568 109322.43935)
    (308.2764 98597.11350)
    (312.1960 88510.89888)
    (316.1156 79063.79552)
    (320.0352 70255.80344)
    (323.9548 62086.92268)
    (327.8744 54557.15330)
    (331.7940 47666.49535)
    (335.7136 41414.94894)
    (339.6332 35802.51420)
    (343.5528 30829.19136)
    (347.4724 26494.98077)
    (351.3920 22799.88304)
    (355.3116 19743.89933)
    (359.2312 17327.03215)
    (363.1508 15549.28807)
    (367.0704 14410.69165)
    (370.9899 13911.48019)
    (374.9095 14050.12738)
    (378.8291 14829.07596)
    (382.7487 16246.91913)
    (386.6683 18303.84049)
    (390.5879 20999.86182)
    (394.5075 24334.98916)
    (398.4271 28309.22487)
    (402.3467 32922.57005)
    (406.2663 38175.02527)
    (410.1859 44066.59089)
    (414.1055 50597.26712)
    (418.0251 57767.05408)
    (421.9447 65575.95188)
    (425.8643 74023.96058)
    (429.7839 83111.08023)
    (433.7035 92837.31087)
    (437.6231 103202.65251)
    (441.5427 114207.10519)
    (445.4623 125850.66892)
    (449.3819 138133.34371)
    (453.3015 151055.12957)
    (457.2211 164616.02651)
    (461.1407 178816.03454)
    (465.0603 193655.15367)
    (468.9799 209133.38389)
    (472.8995 225250.72522)
    (476.8191 242007.17765)
    (480.7387 259402.74119)
    (484.6583 277437.41585)
    (488.5779 296111.20161)
    (492.4975 315424.09850)
    (496.4171 335376.10650)
    (500.3367 355967.22562)
    (504.2563 377197.45586)
    (508.1759 399066.79722)
    (512.0955 421575.24970)
    (516.0151 444722.81331)
    (519.9347 468509.48804)
    (523.8543 492935.27390)
    (527.7739 518000.17088)
    (531.6935 543704.17899)
    (535.6131 570047.29822)
    (539.5327 597029.52858)
    (543.4523 624650.87007)
    (547.3719 652911.32269)
    (551.2915 681810.88644)
    (555.2111 711349.56131)
    (559.1307 741527.34732)
    (563.0503 772344.24445)
    (566.9698 803800.25271)
    (570.8894 835895.37211)
    (574.8090 868629.60263)
    (578.7286 902002.94428)
    (582.6482 936015.39707)
    (586.5678 970666.96098)
    (590.4874 1005957.63603)
    (594.4070 1041887.42220)
    (598.3266 1078456.31951)
    (602.2462 1115664.32795)
    (606.1658 1153511.44751)
    (610.0854 1191997.67822)
    (614.0050 1231123.02005)
    (617.9246 1270887.47301)
    (621.8442 1311291.03711)
    (625.7638 1352333.71233)
    (629.6834 1394015.49869)
    (633.6030 1436336.39618)
    (637.5226 1479296.40481)
    (641.4422 1522895.52456)
    (645.3618 1567133.75545)
    (649.2814 1612011.09747)
    (653.2010 1657527.55062)
    (657.1206 1703683.11490)
    (661.0402 1750477.79032)
    (664.9598 1797911.57687)
    (668.8794 1845984.47455)
    (672.7990 1894696.48336)
    (676.7186 1944047.60331)
    (680.6382 1994037.83439)
    (684.5578 2044667.17660)
    (688.4774 2095935.62995)
    (692.3970 2147843.19442)
    (696.3166 2200389.87003)
    (700.2362 2253575.65677)
    (704.1558 2307400.55465)
    (708.0754 2361864.56366)
    (711.9950 2416967.68380)
    (715.9146 2472709.91507)
    (719.8342 2529091.25748)
    (723.7538 2586111.71102)
    (727.6734 2643771.27569)
    (731.5930 2702069.95149)
    (735.5126 2761007.73843)
    (739.4322 2820584.63650)
    (743.3518 2880800.64571)
    (747.2714 2941655.76605)
    (751.1910 3003149.99752)
    (755.1106 3065283.34012)
    (759.0302 3128055.79386)
    (762.9497 3191467.35872)
    (766.8693 3255518.03473)
    (770.7889 3320207.82186)
    (774.7085 3385536.72013)
    (778.6281 3451504.72953)
    (782.5477 3518111.85007)
    (786.4673 3585358.08174)
    (790.3869 3653243.42454)
    (794.3065 3721767.87847)
    (798.2261 3790931.44354)
    (802.1457 3860734.11974)
    (806.0653 3931175.90708)
    (809.9849 4002256.80554)
    (813.9045 4073976.81514)
    (817.8241 4146335.93588)
    (821.7437 4219334.16774)
    (825.6633 4292971.51074)
    (829.5829 4367247.96488)
    (833.5025 4442163.53015)
    (837.4221 4517718.20655)
    (841.3417 4593911.99408)
    (845.2613 4670744.89275)
    (849.1809 4748216.90255)
    (853.1005 4826328.02348)
    (857.0201 4905078.25555)
    (860.9397 4984467.59875)
    (864.8593 5064496.05308)
    (868.7789 5145163.61855)
    (872.6985 5226470.29515)
    (876.6181 5308416.08288)
    (880.5377 5391000.98175)
    (884.4573 5474224.99175)
    (888.3769 5558088.11288)
    (892.2965 5642590.34515)
    (896.2161 5727731.68855)
    (900.1357 5813512.14308)
    (904.0553 5899931.70875)
    (907.9749 5986990.38555)
    (911.8945 6074688.17348)
    (915.8141 6163025.07255)
    (919.7337 6252001.08275)
    (923.6533 6341616.20408)
    (927.5729 6431870.43655)
    (931.4925 6522763.78015)
    (935.4121 6614296.23488)
    (939.3317 6706467.80075)
    (943.2513 6799278.47775)
    (947.1709 6892728.26588)
    (951.0905 6986817.16515)
    (955.0101 7081545.17555)
    (958.9296 7176912.29709)
    (962.8492 7272918.52975)
    (966.7688 7369563.87356)
    (970.6884 7466848.32849)
    (974.6080 7564771.89456)
    (978.5276 7663334.57176)
    (982.4472 7762536.36009)
    (986.3668 7862377.25956)
    (990.2864 7962857.27016)
    (994.2060 8063976.39190)
    (998.1256 8165734.62477)
    (1002.0452 8268131.96877)
    (1005.9648 8371168.42391)
    (1009.8844 8474843.99017)
    (1013.8040 8579158.66758)
    (1017.7236 8684112.45611)
    (1021.6432 8789705.35578)
    (1025.5628 8895937.36659)
    (1029.4824 9002808.48852)
    (1033.4020 9110318.72159)
    (1037.3216 9218468.06579)
    (1041.2412 9327256.52113)
    (1045.1608 9436684.08760)
    (1049.0804 9546750.76520)
    (1053.0000 9657456.55394)
)