tutorials/heatTransfer/directChillFoam/Subroto2021/constant/tStar
(
    (-9999.0 805.50300)
    (0.00000 805.50300)
    (0.01011 817.50300)
    (0.02188 824.39500)
    (0.03245 836.45900)
    (0.04298 850.75400)
    (0.05429 863.64600)
    (0.06528 872.34800)
    (0.07561 878.34800)
    (0.08990 884.34800)
    (0.10247 888.32400)
    (0.11850 892.32400)
    (0.13989 896.32400)
    (0.15345 898.32400)
    (0.16960 900.32400)
    (0.18914 902.32400)
    (0.20258 904.10900)
    (0.21997 906.10900)
    (0.24044 908.10900)
    (0.26483 910.10900)
    (0.29432 912.10900)
    (0.33058 914.10900)
    (0.37602 916.10900)
    (0.43420 918.10900)
    (0.51019 920.10900)
    (0.61030 922.10900)
    (0.73751 924.10900)
    (0.87752 926.10900)
    (0.99846 928.10900)
    (1.00000 928.23600)
    (9999.00 928.23600)
)