tutorials/heatTransfer/directChillFoam/Subroto2021/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format          ascii;
    class           dictionary;
    location        "constant";
    object          transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

g_env           [ 0 0 0 0 0 0 0 ] 0.7;
rho1            [ 1 -3 0 0 0 0 0 ] 2378.65;
rho2            [ 1 -3 0 0 0 0 0 ] 2602.04;
mu1             [ 1 -1 -1 0 0 0 0 ] 0.0010155;
mu2             [ 1 -1 -1 0 0 0 0 ] 0.0010155;
DAS             [ 0 1 0 0 0 0 0 ] 0.000185;


// ************************************************************************* //
