tutorials/heatTransfer/directChillFoam/Subroto2021/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format          ascii;
    class           dictionary;
    location        "system";
    object          blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    ( 0.0000   0.0000 -300.0) //  0
    (77.4262   3.3805 -300.0) //  1
    (77.4262  -3.3805 -300.0) //  2
    
    ( 0.0000   0.0000  -57.0) //  3
    (77.4262   3.3805  -57.0) //  4
    (77.4262  -3.3805  -57.0) //  5
    
    ( 0.0000   0.0000  -50.0) //  6
    (77.4262   3.3805  -50.0) //  7
    (77.4262  -3.3805  -50.0) //  8
    
    ( 0.0000   0.0000  -40.0) //  9
    (77.4262   3.3805  -40.0) // 10
    (77.4262  -3.3805  -40.0) // 11
    
    ( 0.0000   0.0000    0.0) // 12
    (77.4262   3.3805    0.0) // 13
    (77.4262  -3.3805    0.0) // 14
    
    ( 0.0000   0.0000  170.0) // 15
    (77.4262   3.3805  170.0) // 16
    (77.4262  -3.3805  170.0) // 17
);

blocks
(
    hex ( 0  2  1  0  3  5  4  3) domain (38 1 121) simpleGrading (0.5 1 1) //  0
    hex ( 3  5  4  3  6  8  7  6) domain (38 1   3) simpleGrading (0.5 1 1) //  1
    hex ( 6  8  7  6  9 11 10  9) domain (38 1   5) simpleGrading (0.5 1 1) //  2
    hex ( 9 11 10  9 12 14 13 12) domain (38 1  20) simpleGrading (0.5 1 1) //  3
    hex (12 14 13 12 15 17 16 15) domain (38 1  85) simpleGrading (0.5 1 1) //  4
);

edges
(
    arc  1  2 (77.5000  0.0000 -300.0)
    arc  4  5 (77.5000  0.0000  -57.0)
    arc  7  8 (77.5000  0.0000  -50.0)
    arc 10 11 (77.5000  0.0000  -40.0)
    arc 13 14 (77.5000  0.0000    0.0)
    arc 16 17 (77.5000  0.0000  170.0)
);

boundary
(
    water-film
    {
        type wall;
        faces
        (
            ( 1  2  5  4)
        );
    }

    air-gap
    {
        type wall;
        faces
        (
            ( 4  5  8  7)
        );
    }

    mould
    {
        type wall;
        faces
        (
            ( 7  8 11 10)
        );
    }

    graphite
    {
        type wall;
        faces
        (
            (10 11 14 13)
        );
    }

    hot-top
    {
        type wall;
        faces
        (
            (13 14 17 16)
        );
    }

    ram
    {
        type patch;
        faces
        (
            ( 0  2  1  0)
        );
    }

    free-surface
    {
        type patch;
        faces
        (
            (15 17 16 15)
        );
    }

    axis
    {
        type empty;
        faces
        (
            ( 3  0  0  3)
            ( 6  3  3  6)
            ( 9  6  6  9)
            (12  9  9 12)
            (15 12 12 15)
        );
    }

    symmetry_planes
    {
        type symmetry;
        faces
        (
            ( 0  1  4  3)
            ( 5  2  0  3)
            ( 3  4  7  6)
            ( 8  5  3  6)
            ( 6  7 10  9)
            (11  8  6  9)
            ( 9 10 13 12)
            (14 11  9 12)
            (12 13 16 15)
            (17 14 12 15)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
